In [101]:
import numpy as np
# import matplotlib.plotly as plt
import matplotlib.pyplot as plt
from matplotlib import pyplot as plt  
import pandas as pd
#imputer to handle missing data 
from sklearn.preprocessing import Imputer
from sklearn.model_selection import train_test_split

from sklearn.linear_model import LinearRegression
#o check accuracy
from sklearn.metrics import accuracy_score
# to check accuracy
from sklearn.metrics import *
import pickle 
#visualization in 3D
from mpl_toolkits.mplot3d import Axes3D
# ignore warnings
import warnings
warnings.filterwarnings('ignore')

import csv

In [102]:
# load dataset
dataset_original = pd.read_csv ("Salary_Data.csv")
dataset = dataset_original
dataset.head()

   YearsExperience   Salary
0              1.1  39343.0
1              1.3  46205.0
2              1.5  37731.0
3              2.0  43525.0
4              2.2  39891.0

In [103]:
print("Dataset has {} rows and {} Columns".format(dataset.shape[0],dataset.shape[1]))

Dataset has 30 rows and 2 Columns

In [104]:
# check dataset information
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 2 columns):
YearsExperience    30 non-null float64
Salary             30 non-null float64
dtypes: float64(2)
memory usage: 560.0 bytes

In [105]:
dataset.describe().T

,count,mean,std,min,25%,50%,75%,max
YearsExperience,30.0,5.313333,2.837888,1.1,3.20,4.7,7.70,10.5
Salary,30.0,76003.000000,27414.429785,37731.0,56720.75,65237.0,100544.75,122391.0

In [134]:
# handling missing data if nessesary
dataset.isna().sum()

YearsExperience    0
Salary             0
dtype: int64

In [212]:
# seperate fetures and label
x_data = dataset.iloc[:, :-1]
y_data = dataset.iloc[:, 1]

In [213]:
x_data.shape

(30, 1)

In [108]:
# def splitdata(x_data, y_data):
    
    
    
#     x_train, x_test, y_train, y_test = train_test_split(x_data,y_data,test_size, random_state=0)

In [218]:
#splitting the dataset
# 1/3 = 0.33
x_train, x_test, y_train, y_test = train_test_split(x_data,y_data,test_size = 0.3 , random_state=42)

In [219]:
# y_data = pd.DataFrame(y_data)
type(y_test), type(y_test)

(pandas.core.frame.DataFrame, pandas.core.frame.DataFrame)

In [220]:
y_test

      Salary
27  112635.0
15   67938.0
23  113812.0
17   83088.0
8    64445.0
9    57189.0
28  122391.0
24  109431.0
12   56957.0

In [200]:
x_test

    YearsExperience
27              9.6
15              4.9
23              8.2
17              5.3
8               3.2
9               3.7
28             10.3
24              8.7
12              4.0

In [224]:
y_test

      Salary
27  112635.0
15   67938.0
23  113812.0
17   83088.0
8    64445.0
9    57189.0
28  122391.0
24  109431.0
12   56957.0

In [125]:
# import csv

In [225]:
myData = x_test
myFile = open('x_test_data.csv', 'w')  
with myFile:
    writer = csv.writer(myFile)
    writer.writerows(myData)
# colomn
# colnames=['x_test'] 
df = pd.read_csv('x_test_data.csv', names=colnames, header=None)
# inserting column with static value in data frame 
df.insert(1, "y_test", y_test) 
 
# displaying data frame again - Output 2 
df

                            x_test  y_test
Y e a r s E x p e r i e n c      e     NaN

In [160]:
l = [pd.DataFrame(x_test)]
# l = [x_test, y_test]
# pd.DataFrame(l)
# type([x_test])

pandas.core.frame.DataFrame

In [227]:
col_c_info = ['x_test', 'y_test']
my_dict  = {'x_test': x_test, 'y_test': y_test}
def dict_to_csv(my_dict,col_c_info):
#     my_dict = scraped_values_dict 
    with open('Data.csv', 'a') as f: 
        w = csv.DictWriter(f, col_c_info) 
        if f.tell() == 0: 
            w.writeheader() 
            w.writerow(my_dict) 
        else: 
            w.writerow(my_dict)
            
dict_to_csv(d1, col_c_info)

In [228]:
df = pd.read_csv('Data.csv')
df.head()
# y_test[:]

,x_test,y_test
0,0\n0 1.5\n1 10.3\n2 4.1\n3 3.9\n4...,Salary\n2 37731.0\n28 122391.0\n13 ...

In [129]:
df.to_csv("TestEx.csv",index= False)

In [181]:
# d1 = {}
# d1 = {'x_test': pd.DataFrame(x_test), 'y_test': pd.DataFrame(y_test)}
# data = [[x_test], [y_test]]
# df1 = pd.DataFrame(data,columns=['x_test','y_test'])
# df1 = pd.DataFrame(data=d1)
dd1 = pd.DataFrame(x_test)
dd2 = pd.DataFrame(y_test)
# df = pd.concat[dd1,dd2]
dd2.head()

      Salary
2    37731.0
28  122391.0
13   57081.0
10   63218.0
26  116969.0

In [176]:
d1["x_test"][0][0]

1.5

In [132]:
df.head()

   x_test   y_test
0     1.5      NaN
1    10.3      NaN
2     4.1  37731.0
3     3.9      NaN
4     9.5      NaN

In [ ]:
# divide train data into train and cross validation 
x_train_data, x_cv, y_train_data, y_cv = train_test_split(x_train,y_train,test_size = 0.20,random_state=0)

In [ ]:
# x_test.tocsv

In [ ]:
x_train_data.shape

In [ ]:
x_cv.shape

In [ ]:
# fitting simple LR to the training set
regression = LinearRegression()
regression.fit(x_train_data, y_train_data)

In [ ]:
# dump train model pickle file
file = open('newfile.pkl', 'wb')
pickle.dump(regression,file)
file.close()

In [ ]:
# predicting the test set result
# y_predict = regression.predict(x_test)
y_predict_train = regression.predict(x_train)

In [ ]:
y_predict_train

In [ ]:
# Visualization the training set result
plt.scatter(x_train,y_train, color = 'red')
plt.plot(x_train,regression.predict(x_train), color = 'blue')
plt.title("Salary vr Experience (Training set)")
plt.xlabel("Year of experience")
plt.ylabel("Salary")
plt.show()

In [ ]:
# Visualization the testing set result
plt.scatter(x_test,y_test, color = 'red')
plt.plot(x_train,regression.predict(x_train), color = 'blue')
plt.title("Salary vr Experience (Testing set)")
plt.xlabel("Year of experience")
plt.ylabel("Salary")
plt.show()

In [ ]:
# accuracy using r2 score
# Accuracy_test = r2_score(y_predict,y_test)*100
Accuracy_train = r2_score(y_predict_train,y_train)*100

In [ ]:
# accuracy using r2 score
# Accuracy_test = r2_score(y_predict,y_test)*100
Accuracy_train = r2_score(y_predict_train,y_train)*100
# print("Accuracy test ", Accuracy_test)
print("Accuracy train", Accuracy_train)

In [ ]:
# Regression is an error minimization problem and the regression metrics should be
# r_square (R^2), mean absolute error (MAE), mean_squared_error (MSE) and root mean squared error (RMSE).

In [ ]:
# Accuracy using Mean average error
mean_absolute_error(y_test, y_predict)
# mean_absolute_error(y_test, y_predict, multioutput='raw_values')

In [ ]:
# fig = plt.figure(figsize=(10,10))
# ax = Axes3D(fig)
# ax.scatter(dataset.iloc[:,0],dataset.iloc[:,1],color='g')
# ax.plot_wireframe(X=[x_train.min(),x_train.max()],Y=[y_train.min(),y_train.max()],Z=y_predict,linewidth = 1.2,color='r')
# print(linear_reg.coef_)
# plt.show()